{
    "reviews": [
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Professor Gonzalez knows his stuff and makes this museum class engaging. The work can be tedious, but he's always willing to help. I found unstuckstudy AI and the free textbook super useful for staying on top of things."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Professor Gonzalez brings a lot of enthusiasm and hands-on experiences to his ANTH377 class. While the workload can be a bit heavy at times, he is always willing to provide extra support to help students succeed. If you're interested in anthropology, this is a great class to take."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " 120ANTH",
            "review": "If you plan on taking Professor Gonzalez's course, note that quizzes are manageable if you study the slides thoroughly and take detailed notes for exam preparation. No electronic devices are allowed and attendance is mandatory. Professor Gonzalez is a passionate and engaging speaker who makes his lectures memorable and humorous. :)"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH120",
            "review": "Good teacher quizzes are easy and directly off the slides. Big thing is no electronics at all so no phones laptops ipads ect. Taking notes is purely on paper but overall interesting lectures and easy to grasp information"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " 120ANTH",
            "review": "Professor Gonzalez has the most amazing and interesting (and hilarious) lectures that are memorable and will probably stick with me for the rest of my life just based on how well of a speaker he is. You can definitely tell that he cares about the content he teaches and wants it to stick with his students as well. Attendance is mandatory!!!"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH120",
            "review": "gives students more time to finish an assignment if needed without deducting points\n"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " 120ANTH",
            "review": "Professor is usually funny which makes this class less boring and more engaging. The class lectures are usually easy to follow along and the assignments are very easy to complete. There are also multiple opportunities to get extra credit."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " 120ANTH",
            "review": "Professor Gonzalez is very funny and very understanding towards his students. Make sure that you always come to class because the class focuses very heavily on the lecture material. This was not really a bad thing though. "
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " 120ANTH",
            "review": "Really funny and keeps lectures interesting"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH120",
            "review": "The testing is timed for a minute per question. I performed poorly on a number of tests because this made me feel panic and rushed through "
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " 120ANTH",
            "review": "Very easy class just take notes \n"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Professor Gonzalez knows what he's talking about when it comes to Archaeology. This was a museum class and if you're looking for hands-on experience that is creative, this class is for you. Professor Gonzalez can be attentive if you catch him at a good time, but he is often a little difficult to reach through email and in person. "
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "This professor has been one of the most patient and understanding professors I've had at this entire time at this college. From when I first was in his intro to archeology to now in his museum class. This class may have been a pretty advanced one, but hey, just so you guys can get a good idea, what I'm getting at is that I'm in my second year."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Dr. Gonzalez gives great animated lectures. I never once felt bored with the material. His class is a safe space for BIPOC LGBTQ+ students. I feel closer to reaching my career goals because of his advice and the course material. Grateful to have had a professor like him. "
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Great instructor. As long as you attend and participate and turn in your assignments, you'll be fine. He's super accessible and would be more than willing to help you grow. Don't let the course intimidate you, just take it!"
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Great professor, The class is fairly easy if you just do the work that is asked of you. He is very funny, which makes his lectures very easy to sit through, although this class doesn't have many. over all great professor, would highly recommend taking a class with him."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Do not hesitate to take a class with prof. Gonzalez! He is very knowledgeable and will gladly help his students with the material. Classes are hands-on and provide you with skills that are beneficial in the anthropological career path. If you're serious about anthro, take any or all courses that Prof Gonzalez offers."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Professor Gonzalez' classes are always engaging. Sometimes the work is tedious, but never unmanagebale. He's always happy to help outside of class as well. "
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Professor really tries to be flexible with students and deadlines if necessary. He can occasionally be distracted and/or not be as helpful as you'd like but tries to give answers or sends you to someone else who could be more helpful."
        },
        {
            "professor": "Albert Gonzalez ",
            "stars": "4.8",
            "subject": " ANTH377",
            "review": "Dr. Gonzalez is a hilarious professor with entertaining yet interesting lectures. He is always willing to provide feedback granted he is available to do so. This class was fairly easy but dependent on your attendance."
        }
    ]
}